<a href="https://colab.research.google.com/github/ryanleeallred/DS-Unit-1-Sprint-2-Data-Wrangling-and-Storytelling/blob/master/module1-join-and-reshape-data/LS_DS_121_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

_Lambda School Data Science_

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
#-nc no clobber basically means --no-overwrite 
!wget -nc https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

File ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ already there; not retrieving.

In [2]:
!tar --gunzip --extract --verbose --no-overwrite-dir --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
%cd instacart_2017_05_01

/home/sqd/Documents/GitHub/DS-Unit-1-Sprint-2-Data-Wrangling-and-Storytelling/module1-join-and-reshape-data/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r-- 1 sqd sqd 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 sqd sqd  270 May  2  2017 departments.csv
-rw-r--r-- 1 sqd sqd 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 sqd sqd  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 sqd sqd 104M May  2  2017 orders.csv
-rw-r--r-- 1 sqd sqd 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [5]:
from IPython.display import display, Image
url = 'https://cdn-images-1.medium.com/max/1600/1*vYGFQCafJtGBBX5mbl0xyw.png'
example = Image(url=url, width=600)
display(example)

In [6]:
# print out the headers of all the files in the directory
!head * -n 1 | column -t -s,

==> aisles.csv <==
aisle_id                           aisle
==> departments.csv <==
department_id                      department
==> order_products__prior.csv <==
order_id                           product_id    add_to_cart_order  reordered
==> order_products__train.csv <==
order_id                           product_id    add_to_cart_order  reordered
==> orders.csv <==
order_id                           user_id       eval_set           order_number   order_dow  order_hour_of_day  days_since_prior_order
==> products.csv <==
product_id                         product_name  aisle_id           department_id

##### Steps
- read the needed csvs
    * order_products__prior need order_id, product_id, add_to_cart_order
    * order_product__train need same
    * order.csv need order_id user_id order_number order_dow order_hour_of_day
    * products need product_id product_name
- need to merge order_products __prior and __train
- need to merge in everything together after that
- then count each product and how much it occurs
- then need to get the top 10

In [7]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [8]:
# read the needed csvs
order_products__prior = pd.read_csv('order_products__prior.csv')
order_products__train = pd.read_csv('order_products__train.csv')
orders                = pd.read_csv('orders.csv')
products              = pd.read_csv('products.csv')

In [9]:
# merge order_products __prior and __train
assert order_products__prior.shape[1] == order_products__train.shape[1]
order_products = pd.concat([order_products__prior, order_products__train])

In [10]:
# merge everything else based on the readout. 
merged = (products[['product_id', 'product_name']]
          .merge(order_products[['order_id', 'product_id', 'add_to_cart_order']])
          .merge(orders[['order_id', '' 'order_hour_of_day', 'user_id']])) 
merged.head()
flights.pivot_table(index='year',columns='month')

,product_id,product_name,order_id,add_to_cart_order,order_hour_of_day,user_id
0,1,Chocolate Sandwich Cookies,1107,7,11,38259
1,769,Sliced American Cheese,1107,10,11,38259
2,6184,Clementines,1107,14,11,38259
3,8048,Packaged Grape Tomatoes,1107,15,11,38259
4,9007,Frosted Flakes,1107,17,11,38259

In [11]:
# then count each product and how much it occurs
# and get the top ten
merged['product_name'].value_counts()[:10]

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

In [12]:
# condition = (orders['user_id'] == 1) & (orders['order_number'] <= 2)
# columns = [
#     'user_id',
#     'order_id',
#     'order_number',
#     'order_dow',
#     'order_hour_of_day'
# ]
# subset = orders.loc[condition, columns]
# subset

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [14]:
# first thing load in the tables 
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

table1_raw = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2_raw = table1_raw.T

# reset_index use default indexing with 0 through whatever instead.
# ?table1.reset_index
table1 = table1_raw.reset_index()
table1

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [4]:
table1_raw

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [5]:
table2_raw

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [6]:
table1_raw.columns.to_list()

['treatmenta', 'treatmentb']

In [7]:
table1_raw.index.to_list()

['John Smith', 'Jane Doe', 'Mary Johnson']

In [8]:
tidy = (table1.melt(id_vars='index', value_vars=['treatmenta', 'treatmentb'])
        .rename(columns={
            'index':'name',
            'variable':'trt',
            'value':'result'
            }))
tidy.trt = tidy.trt.str.replace('treatment', '')

tidy

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

In [16]:
from dfply import *
tidy = (table1 
        >> gather('trt', 'result', ['treatmenta', 'treatmentb'])
        >> mutate(trt=X.trt.str.replace('treatment','')))
tidy.head()

          index trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0

In [19]:
# https://stackoverflow.com/questions/49046317/pandas-pivot-merge-multiple-columns-into-single-using-column-headers-as-values
# 
# Use:
# 
# set_index of columns for not reshaping
# reshape all another columns by stack - NaNs rows are dropped
# reorder_levels for change final ordering of columns
# reset_index for columns from MultiIndex
# remove column by drop
# rename first column
# 
# df = (df.set_index(['time','id'])
#        .stack()
#        .reorder_levels([2,0,1])
#        .reset_index(name='a')
#        .drop('a', 1)
#        .rename(columns={'level_0':'type'}))

In [17]:
table2 = table2_raw.reset_index().rename(columns={'index':'trt'})
table2

          trt  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [38]:
tidy2 = (table2.melt(value_vars=['John Smith', 'Jane Doe', 'Mary Johnson'],
                         var_name='name',
                         id_vars='trt',
                         value_name='result'
                        ))
tidy2.trt = tidy2.trt.str.replace('treatment','')
# adjust tidy2 so that name is used as the index column
tidy2 = tidy2.set_index('name') 
tidy2

             trt  result
name
John Smith     a     NaN
John Smith     b     2.0
Jane Doe       a    16.0
Jane Doe       b    11.0
Mary Johnson   a     3.0
Mary Johnson   b     1.0

In [48]:
tidy2 = (table2.melt(value_vars=['John Smith', 'Jane Doe', 'Mary Johnson'],
                     var_name='name',
                     id_vars='trt',
                     value_name='result'))
tidy2.trt = tidy2.trt.str.replace('treatment','')
tidy2 = tidy2.set_index('name')

In [49]:
tidy2.head()

             trt  result
name
John Smith     a     NaN
John Smith     b     2.0
Jane Doe       a    16.0
Jane Doe       b    11.0
Mary Johnson   a     3.0

In [22]:
## Tidy -> Table2
table2

          trt  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [23]:
# df.pivot(index='date', columns='name', values='dollars')
tidy2.reset_index().pivot(index='trt', columns='name', values='result')

name  Jane Doe  John Smith  Mary Johnson
trt
a         16.0         NaN           3.0
b         11.0         2.0           1.0

In [53]:
tidy2.reset_index().pivot(index='trt',columns='name',values='result')

name  Jane Doe  John Smith  Mary Johnson
trt
a         16.0         NaN           3.0
b         11.0         2.0           1.0

In [24]:
# ?table2.melt

In [55]:
# Load seaborn's flights dataset by running the cell below. 
#Then create a pivot table showing the number of passengers by month and year. 
#Use year for the index and month for the columns. You've done it right if you get 
#112 passengers for January 1949 and 432 passengers for December 1960.
flights = sns.load_dataset('flights')
flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [58]:
# pivot tables can be useful for making thigns easier to lookup for a person
flights.pivot_table(index='year', columns='month', values='passengers')

month,January,February,March,April,May,June,July,August,September,October,November,December
year,,,,,,,,,,,,
1949,112,118,132,129,121,135,148,148,136,119,104,118
1950,115,126,141,135,125,149,170,170,158,133,114,140
1951,145,150,178,163,172,178,199,199,184,162,146,166
1952,171,180,193,181,183,218,230,242,209,191,172,194
1953,196,196,236,235,229,243,264,272,237,211,180,201
1954,204,188,235,227,234,264,302,293,259,229,203,229
1955,242,233,267,269,270,315,364,347,312,274,237,278
1956,284,277,317,313,318,374,413,405,355,306,271,306
1957,315,301,356,348,355,422,465,467,404,347,305,336
1958,340,318,362,348,363,435,491,505,404,359,310,337
1959,360,342,406,396,420,472,548,559,463,407,362,405
1960,417,391,419,461,472,535,622,606,508,461,390,432

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [27]:
#instacart data again
merged.head()

,product_id,product_name,order_id,add_to_cart_order,order_hour_of_day,user_id
0,1,Chocolate Sandwich Cookies,1107,7,11,38259
1,769,Sliced American Cheese,1107,10,11,38259
2,6184,Clementines,1107,14,11,38259
3,8048,Packaged Grape Tomatoes,1107,15,11,38259
4,9007,Frosted Flakes,1107,17,11,38259

#### Produce top 25  latest (in the day) ordered popular products (products with more than 2,900 orders)

>* Need to filter the popular products
>* Subset dataframe in the last day to only popular products
>* Get the 25 latest products

In [28]:
#Series has index, data, dtype, and name
#product_counts = merged['product_name'].value_counts()
popular_product_names = (merged['product_name'].value_counts() > 2900).index.to_list()
popular_products = merged[merged['product_name'].isin(popular_product_names)]
popular_products.head()

,product_id,product_name,order_id,add_to_cart_order,order_hour_of_day,user_id
0,1,Chocolate Sandwich Cookies,1107,7,11,38259
1,769,Sliced American Cheese,1107,10,11,38259
2,6184,Clementines,1107,14,11,38259
3,8048,Packaged Grape Tomatoes,1107,15,11,38259
4,9007,Frosted Flakes,1107,17,11,38259

In [33]:
# now I need to get the ones in teh last day. Could go to the end (by order_id) and find 23, then
# go up one to get the latest day.
popular_products_sorted_by_order_id = popular_products.sort_values(by='order_id')
index_of_first_order_of_day = popular_products_sorted_by_order_id.order_hour_of_day.idxmin()

7724636

In [ ]:
#Return index of first occurrence of minimum over requested axis.

In [30]:
?pd.Series

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [31]:
##### YOUR CODE HERE #####